# ---- Files and text ---- #

# rg (ripgrep) - faster grep with sane defaults
# https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# fd - friendlier find
# https://github.com/sharkdp/fd
brew "fd"

# sd - intuitive sed replacement
# https://github.com/chmln/sd
brew "sd"

# ast-grep (sg) - structural search/rewrite by AST, not regex
# https://github.com/ast-grep/ast-grep
brew "ast-grep"

# bat - cat with syntax highlighting and line numbers
# https://github.com/sharkdp/bat
brew "bat"

# glow - terminal markdown renderer
# https://github.com/charmbracelet/glow
brew "glow"

# eza - modern ls with git status, icons, tree mode
# https://github.com/eza-community/eza
brew "eza"

# erdtree (erd) - tree replacement with size aggregation and gitignore
# https://github.com/solidiquis/erdtree
brew "erdtree"

# micro - modeless terminal editor with mouse support
# https://github.com/zyedidia/micro
brew "micro"

# jq - JSON processor
# https://github.com/jqlang/jq
brew "jq"

# yq - jq for YAML
# https://github.com/mikefarah/yq
brew "yq"

# tokei - line counter, faster than cloc
# https://github.com/XAMPPRocky/tokei
brew "tokei"

# ouch - universal archive (un)packer
# https://github.com/ouch-org/ouch
brew "ouch"

# uutils-coreutils - Rust port of GNU coreutils (ls, cp, mv, cat, etc.)
# https://github.com/uutils/coreutils
brew "uutils-coreutils"

# uutils-diffutils - Rust port of GNU diffutils (diff, cmp, etc.)
# https://github.com/uutils/diffutils
brew "uutils-diffutils"

# uutils-findutils - Rust port of GNU findutils (find, xargs, etc.)
# https://github.com/uutils/findutils
brew "uutils-findutils"

# ---- Shell ---- #

# fzf - fuzzy finder (anti-TUI exception: magic)
# https://github.com/junegunn/fzf
brew "fzf"

# atuin - shell history with multi machine sync (anti-TUI exception: fzf-class)
# https://github.com/atuinsh/atuin
brew "atuin"

# zoxide - smarter cd that learns frequent dirs
# https://github.com/ajeetdsouza/zoxide
brew "zoxide"

# starship - cross-shell prompt
# https://github.com/starship/starship
brew "starship"

# navi - interactive cheatsheet TUI (anti-TUI exception: fzf-proxy)
# https://github.com/denisidoro/navi
brew "navi"

# ---- System and network ---- #

# bottom (btm) - htop replacement with graphs (TUI; no non-TUI live monitor exists)
# https://github.com/ClementTsang/bottom
brew "bottom"

# procs - modern ps
# https://github.com/dalance/procs
brew "procs"

# dust - du with sane visuals
# https://github.com/bootandy/dust
brew "dust"

# duf - df replacement, friendly tables
# https://github.com/muesli/duf
brew "duf"

# doggo - command-line DNS client
# https://github.com/mr-karan/doggo
brew "doggo"

# httpie - HTTP client
# https://github.com/httpie/cli
brew "httpie"

# trippy (trip) - mtr/traceroute replacement (TUI default; has --report CLI mode)
# https://github.com/fujiapple852/trippy
brew "trippy"

# fping - multi-host ping with CLI summary (non-TUI gping shape)
# https://github.com/schweikert/fping
brew "fping"

# nethogs - per-process bandwidth (use -t for streaming text; non-TUI bandwhich shape)
# https://github.com/raboof/nethogs
brew "nethogs"

# ---- Dev ---- #

# delta - syntax-highlighted git diff pager
# https://github.com/dandavison/delta
brew "git-delta"

# gh - GitHub CLI
# https://github.com/cli/cli
brew "gh"

# dive - explore docker image layers (TUI default; has --ci CLI mode)
# https://github.com/wagoodman/dive
brew "dive"

# stern - multi-pod log tailing (kubectl logs only handles one pod)
# https://github.com/stern/stern
brew "stern"

# mkcert - local-CA TLS certs for dev
# https://github.com/FiloSottile/mkcert
brew "mkcert"

# uv - fast Python package + project manager. Astral.
# https://github.com/astral-sh/uv
brew "uv"

# ruff - fast Python linter + formatter. Astral.
# https://github.com/astral-sh/ruff
brew "ruff"

# watchexec - run command on file change
# https://github.com/watchexec/watchexec
brew "watchexec"

# direnv - per-directory environment
# https://direnv.net (https://github.com/direnv/direnv)
brew "direnv"

# mise - runtime version manager (asdf/nvm/pyenv/rbenv replacement)
# https://github.com/jdx/mise
brew "mise"

# ---- Casks ---- #

# Warp - terminal emulator with block UI
# https://www.warp.dev
cask "warp"

# Visual Studio Code - editor
# https://code.visualstudio.com
cask "visual-studio-code"

# Obsidian - markdown notes / vault
# https://obsidian.md
cask "obsidian"

# Google Chrome - browser
# https://www.google.com/chrome
cask "google-chrome"

# Tailscale - mesh VPN
# https://tailscale.com
cask "tailscale"

# Aptakube - modern Kubernetes GUI (Headlamp successor)
# https://aptakube.com
cask "aptakube"

# OrbStack - fast Docker Desktop / k8s replacement for macOS
# https://orbstack.dev
cask "orbstack"

# Proxyman - HTTP/HTTPS inspector GUI
# https://proxyman.io
cask "proxyman"

# TablePlus - database GUI (Postgres/MySQL/SQLite/etc)
# https://tableplus.com
cask "tableplus"
